## EDA을 위한 다양한 pandas function 연습  
---
참고링크 : https://pandas.pydata.org/docs/user_guide/10min.html  
한글 : https://dandyrilla.github.io/2017-08-12/pandas-10min/

API ref : https://pandas.pydata.org/docs/reference/index.html

In [335]:
import numpy as np
import pandas as pd

### series and dataFrame 

차이점을 기억해 두자  
series 1차 배열  
dataFrame 2차 배열  

실제 data 특성에 맞는 샘플 데이터를 만들수 있어야 한다.   
해당 샘플 데이터로 각 연산 결과를 미리 확인 할 수 있어야 한다.   
print(type()) 을 이용하여 object 의 타입을 정확히 파악해야 한다.  
( series[index_label] vs dataframe[column_label] )  
answer.ipynb 와 test.ipynb, sample.ipynb 으로 운영한다. 

```
pd.DataFrame( Serise, 
              columns = ['',''])
              index = lsit
            )

pd.DataFrame(
    { 
      'A': list
      'B': ['', '']
    },
    index=['','']
    )
```

In [336]:
pd.DataFrame({ 
    'B': ['B', 'C'],
}, index= [1,2])

   B
1  B
2  C

In [337]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [338]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [339]:
# df 만드든 방법 1

df = pd.DataFrame(np.random.randn(6, 4),
                   index=dates, 
                   columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-03  1.123943  0.451903  0.456308 -0.528767
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-06 -0.242982  0.587188  1.516225  0.959050

In [340]:
S = df.A
S[1:]   # silicing

S[1]  # serise indexiting
S[S>1] # serise masking

2013-01-03    1.123943
Freq: D, Name: A, dtype: float64

In [341]:

D = df[['A','B']]

D[1:]   # df slicing
# D[1]    # indexing 은 오류
D[D>1]

                   A         B
2013-01-01       NaN  1.213652
2013-01-02       NaN       NaN
2013-01-03  1.123943       NaN
2013-01-04       NaN       NaN
2013-01-05       NaN       NaN
2013-01-06       NaN       NaN

dataFrame :   
DataFrame은 2차원 배열 데이터라고 이해하는 것보다 공통 인덱스를 가진 column series를 딕셔너리로 묶어놓은 것

In [342]:
# df 만드는 방법 2 

df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2 
# df2[:]
# df2[:][:]
# df2.loc[:,:]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### 2. Viewing Data

In [343]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [344]:
print(df.head(2),'\n')

print(df.tail(2), '\n')

print(df.index, '\n')

print(df.columns, '\n')

df.describe()

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489

                   A         B         C         D
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-06 -0.242982  0.587188  1.516225  0.959050

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Index(['A', 'B', 'C', 'D'], dtype='object')

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.367530  0.184859  0.250335 -0.049104
std    0.620856  0.841839  1.003166  0.810101
min   -0.242982 -1.126837 -0.998607 -0.985489
25%   -0.182894 -0.251678 -0.446179 -0.636800
50%    0.297431  0.460679  0.126428 -0.203134
75%    0.878626  0.557755  1.058045  0.638794
max    1.123943  1.213652  1.516225  0.959050

In [345]:
# 행, 열을 바꾼다. 

df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.941956    0.688637    1.123943   -0.212600   -0.093775   -0.242982
B    1.213652   -0.486205    0.451903    0.469454   -1.126837    0.587188
C   -0.203452   -0.527088    0.456308   -0.998607    1.258623    1.516225
D    0.810892   -0.985489   -0.528767    0.122500   -0.672811    0.959050

In [346]:
df.to_numpy()

array([[ 0.94195573,  1.21365151, -0.20345185,  0.81089216],
       [ 0.68863682, -0.48620549, -0.52708773, -0.98548899],
       [ 1.12394302,  0.45190297,  0.45630828, -0.52876741],
       [-0.21260017,  0.46945412, -0.9986068 ,  0.12250001],
       [-0.09377473, -1.12683726,  1.2586233 , -0.67281061],
       [-0.24298202,  0.58718833,  1.51622537,  0.95905   ]])

In [347]:
df.select_dtypes(include='int64')

Empty DataFrame
Columns: []
Index: [2013-01-01 00:00:00, 2013-01-02 00:00:00, 2013-01-03 00:00:00, 2013-01-04 00:00:00, 2013-01-05 00:00:00, 2013-01-06 00:00:00]

In [348]:
df.select_dtypes(include='number')

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-03  1.123943  0.451903  0.456308 -0.528767
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-06 -0.242982  0.587188  1.516225  0.959050

value_counts()

df.value_counts()   : 1 이상이면 동일한 row 존재  (전부 1이면, 다 값이 다르고, 실재 row 갯수 만큼 나온다.)  
series.value_counts() : 1 이상이면 동일한 값 존재

### 3. Selection 

df[1] : 인텍싱  '정수일때만 가능 (df[df.index == 1] 가 같음), 주로 df 'column' 선택에 사용  
df[2:4] : 슬라이싱  
df[df>1] : 마스킹  

=> 주로 Serise 을 사용할때 사용한다고 생각하자. series[1] / series[2:4] / serise[serise>1]

.             : ```df.col```  
[]            : ```df[column]```         , * df[row_lable: ] 은 사용하지 말자.  
loc (or at)   : df.loc[index_lable,] 은 조건일때만 사용     , ```df.loc[ : , col_label]```    
iloc (or iat) : ```df.iloc[몇번째 row]``` , df.iloc[ : , 몇번째 col]

In [349]:
print(df['A'],'\n')
print(df[:]['A'],'\n')              #df.loc[:,'A']
# df['2013-01-01':]['A']            # chained indexing ?
# df.A

## column 을 선택하게 되며 series 로 리턴된다.


print(df[['A']],'\n')               # df 으로 리턴 
df[['A','C']]                       # dataFrame 리턴

## 2개 이상, 이거나 [[ 'col' ]] 으로 1개 col 을 df 로 리턴

2013-01-01    0.941956
2013-01-02    0.688637
2013-01-03    1.123943
2013-01-04   -0.212600
2013-01-05   -0.093775
2013-01-06   -0.242982
Freq: D, Name: A, dtype: float64

2013-01-01    0.941956
2013-01-02    0.688637
2013-01-03    1.123943
2013-01-04   -0.212600
2013-01-05   -0.093775
2013-01-06   -0.242982
Freq: D, Name: A, dtype: float64

                   A
2013-01-01  0.941956
2013-01-02  0.688637
2013-01-03  1.123943
2013-01-04 -0.212600
2013-01-05 -0.093775
2013-01-06 -0.242982

                   A         C
2013-01-01  0.941956 -0.203452
2013-01-02  0.688637 -0.527088
2013-01-03  1.123943  0.456308
2013-01-04 -0.212600 -0.998607
2013-01-05 -0.093775  1.258623
2013-01-06 -0.242982  1.516225

In [350]:
# 오류 

# print(df[0],'\n')                # 명시적 인덱스 0 을 찾기때문에 오류
# print(df['2013-01-01'],'\n')     # column 에서 찾기 때문에 오류 
print(df['2013-01-01':'2013-01-02'],'\n')  # 근데 이건 됨... 헐.
print(df[:'2013-01-02'],'\n')

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489

In [351]:
# df[0:3]
# df['2013-01-01':'2013-01-03']
print(df['2013-01-04':], '\n')
print(df['2013-01-04':'2013-01-04'], '\n')     # 3, 4 열, label 은 끝 포함
print(df[3:4], '\n')                           # 3열만, index 은 -1 까지
df[3:]

# row 을 선택하게 되며, dataFrame 으로 리턴된다

                   A         B         C         D
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-06 -0.242982  0.587188  1.516225  0.959050

                 A         B         C       D
2013-01-04 -0.2126  0.469454 -0.998607  0.1225

                 A         B         C       D
2013-01-04 -0.2126  0.469454 -0.998607  0.1225

                   A         B         C         D
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-06 -0.242982  0.587188  1.516225  0.959050

In [352]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [353]:
print(df2[:3])  # 이런 형태는 사용하지 말자.  3번째 까지, column 이랑 혼동된다.
# df2.iloc[,:3] 3번째 columns 까지 인건지, df2.iloc[:3,] 3번째 row 인건지??

print(df2.loc[:3,])  # 이것도 사용하지 말자.  3번 까지 , 3번이 어디있을줄 알고... 
# 정수형이 아니면 df.loc[:'서울',] 이건 괜찬을듯.

df2.iloc[:3,]   # 이걸 사용하자. 3번째 까지

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo

In [354]:
#chained indexing?
print(df2[2:4]['A'],'\n')     # row / col
print(df2[2:4][0:4], '\n')     # row seriese 의 row serise
df2[2:4][0:1]                 # 2,3 row 로 만들어진 것에서 다시 0,1 row 첫번째

2    1.0
3    1.0
Name: A, dtype: float64

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

     A          B    C  D     E    F
2  1.0 2013-01-02  1.0  3  test  foo

In [355]:
df2.iloc[0]     # 암묵적 인덱스 0 번째 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 0, dtype: object

In [356]:
df2.loc[2]        # 명시적 인덱스 2 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 2, dtype: object

Row

df.shape[0] = row 행갯수

df.iloc[몇번째 row,]  
df.loc[row_label,]  ```---> row_label 대신 조건절이 들어가면 조건절은 해당 row 의 index label 을 리턴한다.```

으로만 사용

In [357]:
df2.shape, df2.shape[0], df2.shape[1]

((4, 6), 4, 6)

In [358]:
# row label (명시적, 몇번) 을 이용해서 row 을 인덱싱
# index 가 int 인 경우 df.loc[index_int] 도 가능, 
print(df.loc['20130101'],'\n')              # series
print(df.loc['20130101':'20130102'],'\n')   # dataFrame
print(df.loc[['20130101','20130102']],'\n')

# row location (암묵적 , 몇번째) index 을 이용해서 row 인덱싱
print(df.iloc[0],'\n')                      # series
print(df.iloc[0:1],'\n')                    #dataFrame
print(df.iloc[[0,1]],'\n')

A    0.941956
B    1.213652
C   -0.203452
D    0.810892
Name: 2013-01-01 00:00:00, dtype: float64

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489

A    0.941956
B    1.213652
C   -0.203452
D    0.810892
Name: 2013-01-01 00:00:00, dtype: float64

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489

Column

df.shape[1] = columns 열갯수

특정 column 은 몇번째 column 인가? 는 어떻게 찾지?

```
columns 을 추가할때는 인덱스가 없는 list 형태로 입력해야 한다. 
그렇지 않으면, 인덱스가 서로 다를때 입력이 안될수 있다. 
```

In [359]:

# column lable 을 이용해서 column 인덱싱
# print(df.loc['A'],'\n')      # 'A' 을 row 인텍싱으로 생각해서 
print(df.loc[:,'A'],'\n')
print(df.loc[:, ['A']],'\n')
print(df.loc[:,'A':'B'],'\n')
print(df.loc[:,['A','B']],'\n')

2013-01-01    0.941956
2013-01-02    0.688637
2013-01-03    1.123943
2013-01-04   -0.212600
2013-01-05   -0.093775
2013-01-06   -0.242982
Freq: D, Name: A, dtype: float64

                   A
2013-01-01  0.941956
2013-01-02  0.688637
2013-01-03  1.123943
2013-01-04 -0.212600
2013-01-05 -0.093775
2013-01-06 -0.242982

                   A         B
2013-01-01  0.941956  1.213652
2013-01-02  0.688637 -0.486205
2013-01-03  1.123943  0.451903
2013-01-04 -0.212600  0.469454
2013-01-05 -0.093775 -1.126837
2013-01-06 -0.242982  0.587188

                   A         B
2013-01-01  0.941956  1.213652
2013-01-02  0.688637 -0.486205
2013-01-03  1.123943  0.451903
2013-01-04 -0.212600  0.469454
2013-01-05 -0.093775 -1.126837
2013-01-06 -0.242982  0.587188

In [360]:
df.head()

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-03  1.123943  0.451903  0.456308 -0.528767
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811

In [361]:

# column locatin (몇번째) index 을 이용해서 column 인덱싱
print(df.iloc[0],'\n')          # 0 을 row 인텍싱으로 생각해서 0번째 location row 을 인텍싱
print(df.iloc[:,0],'\n')        # 0 번째 column series 리턴
print(df.iloc[:,[0]])           # 0 번째 column df 리턴

A    0.941956
B    1.213652
C   -0.203452
D    0.810892
Name: 2013-01-01 00:00:00, dtype: float64

2013-01-01    0.941956
2013-01-02    0.688637
2013-01-03    1.123943
2013-01-04   -0.212600
2013-01-05   -0.093775
2013-01-06   -0.242982
Freq: D, Name: A, dtype: float64

                   A
2013-01-01  0.941956
2013-01-02  0.688637
2013-01-03  1.123943
2013-01-04 -0.212600
2013-01-05 -0.093775
2013-01-06 -0.242982

In [362]:
print(df.iloc[:,0:2],'\n')

                   A         B
2013-01-01  0.941956  1.213652
2013-01-02  0.688637 -0.486205
2013-01-03  1.123943  0.451903
2013-01-04 -0.212600  0.469454
2013-01-05 -0.093775 -1.126837
2013-01-06 -0.242982  0.587188

In [363]:
print(df.iloc[:,[0,1,3]],'\n')

                   A         B         D
2013-01-01  0.941956  1.213652  0.810892
2013-01-02  0.688637 -0.486205 -0.985489
2013-01-03  1.123943  0.451903 -0.528767
2013-01-04 -0.212600  0.469454  0.122500
2013-01-05 -0.093775 -1.126837 -0.672811
2013-01-06 -0.242982  0.587188  0.959050

In [364]:
df.rename({'A':'a'},axis=1)

                   a         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-03  1.123943  0.451903  0.456308 -0.528767
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-06 -0.242982  0.587188  1.516225  0.959050

In [365]:
df.add_suffix('_S')

                 A_S       B_S       C_S       D_S
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-03  1.123943  0.451903  0.456308 -0.528767
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-06 -0.242982  0.587188  1.516225  0.959050

In [366]:
df.loc[::-1]   # row 순서 역순

                   A         B         C         D
2013-01-06 -0.242982  0.587188  1.516225  0.959050
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-03  1.123943  0.451903  0.456308 -0.528767
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-01  0.941956  1.213652 -0.203452  0.810892

In [367]:
df.loc[:,::-1]  # column 역순

                   D         C         B         A
2013-01-01  0.810892 -0.203452  1.213652  0.941956
2013-01-02 -0.985489 -0.527088 -0.486205  0.688637
2013-01-03 -0.528767  0.456308  0.451903  1.123943
2013-01-04  0.122500 -0.998607  0.469454 -0.212600
2013-01-05 -0.672811  1.258623 -1.126837 -0.093775
2013-01-06  0.959050  1.516225  0.587188 -0.242982

Chained indexing

In [368]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [369]:
df2.loc[0:2,'A']

0    1.0
1    1.0
2    1.0
Name: A, dtype: float64

In [370]:
print(df2.loc[[0,1],['A','B']])    # 숫자가 lable 이다 df[[0,1]] 은 오류
print(df2.iloc[[0,1],[0,1]])

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02
     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02

In [371]:
df

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-03  1.123943  0.451903  0.456308 -0.528767
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-06 -0.242982  0.587188  1.516225  0.959050

In [372]:
df[2:6][df[2:6].A < 0][1:2]

# df 의 2부터 6 row 중 A column  값이 0 보다 작은 두번재 row

                   A         B         C         D
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811

In [373]:
print(df[2:6])
print(df[2:6].A<0)

# 2개의 index가 같아야 한다. 
# IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

                   A         B         C         D
2013-01-03  1.123943  0.451903  0.456308 -0.528767
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-06 -0.242982  0.587188  1.516225  0.959050
2013-01-03    False
2013-01-04     True
2013-01-05     True
2013-01-06     True
Freq: D, Name: A, dtype: bool

Boolean indexing

```(df[])[(df[]) 조건][column]```  
```(df[]).loc[ (df[]) 조건 , column ]```

iloc 는 boolean index 을 사용할 수 없다.  
iLocation based boolean indexing on an integer type is not available

In [374]:
df[df['A']>0]['B']

2013-01-01    1.213652
2013-01-02   -0.486205
2013-01-03    0.451903
Freq: D, Name: B, dtype: float64

In [375]:
df.loc[df['A']>0,'B']

2013-01-01    1.213652
2013-01-02   -0.486205
2013-01-03    0.451903
Freq: D, Name: B, dtype: float64

In [376]:
print(df[1:3].A > 0)  # 이거 대신
df.iloc[1:3].A > 0   # 이걸 사용하자

2013-01-02    True
2013-01-03    True
Freq: D, Name: A, dtype: bool

2013-01-02    True
2013-01-03    True
Freq: D, Name: A, dtype: bool

In [377]:
df.iloc[1:3][df.iloc[1:3].A >0]

                   A         B         C         D
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-03  1.123943  0.451903  0.456308 -0.528767

In [378]:
df[1:3][df[1:3].A > 0]   # chained indexing ???

                   A         B         C         D
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-03  1.123943  0.451903  0.456308 -0.528767

In [379]:
# df[df[1:3].A > 0]  은 오류가 난다.  df 의 index 와 df[1:3] 의 index 가 서로 맞지않다.
# 조건에 대한 true 값의 index label '2013-01-02' 을 리턴한다.
# 따라서 df['2013-01-02'] 가 오류

df[1:3].A > 0

2013-01-02    True
2013-01-03    True
Freq: D, Name: A, dtype: bool

In [380]:
# Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

# df.loc[df[1:3].A > 0] 
df[1:3].loc[df[1:3].A >0]

                   A         B         C         D
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-03  1.123943  0.451903  0.456308 -0.528767

In [381]:
df[1:3][df[0:4].A  > 0]['B']

/var/folders/yn/xbyfmttd1tdc740qcs27ft9m0000gn/T/ipykernel_1487/1907405889.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[1:3][df[0:4].A  > 0]['B']

2013-01-02   -0.486205
2013-01-03    0.451903
Freq: D, Name: B, dtype: float64

In [382]:
#  UserWarning: Boolean Series key will be reindexed to match DataFrame index. 해결방법 

X = df[1:3]
X[X[0:4].A > 0]['B']

2013-01-02   -0.486205
2013-01-03    0.451903
Freq: D, Name: B, dtype: float64

In [383]:
df[1:3][df[1:3].A > 0]['B']
# df1 = df[1:3]
# df1.A > 0
# df1['B']

2013-01-02   -0.486205
2013-01-03    0.451903
Freq: D, Name: B, dtype: float64

funtion indexing

```
pipe()  : Tablewise Function Application
apply() : Row or Column-wise Function Application (df 적용, 행/열 전달. groupby 적용 그룹 전달)
agg() and transform() : Aggregation API
map() : Series 에서 값에 적용한다. (Series 적용, 값 전달)
applymap() : Applying Elementwise Functions  (df 적용, 값을 전달)

pd.cut()    : 조건에 따른 구간별 label  (pd.qcut() : 균등분할)
np.where()  : 조건에 따른 값표시 (아닌값은 NaN)
```

In [384]:
df

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-03  1.123943  0.451903  0.456308 -0.528767
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-06 -0.242982  0.587188  1.516225  0.959050

In [385]:
df3 = df.copy()
df3['sum_row'] = df3.apply(np.sum,axis=1)    # df3.sum(axis=1) 과 같다.
df3

                   A         B         C         D   sum_row
2013-01-01  0.941956  1.213652 -0.203452  0.810892  2.763048
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489 -1.310145
2013-01-03  1.123943  0.451903  0.456308 -0.528767  1.503387
2013-01-04 -0.212600  0.469454 -0.998607  0.122500 -0.619253
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811 -0.634799
2013-01-06 -0.242982  0.587188  1.516225  0.959050  2.819482

In [386]:
# 전체 row 을 순회 (axis =1) 해서 row 갯수 크기의 series 전달

df3["result"] = df3.apply(lambda r: "Over" if r.sum_row > 0 else "Under", axis=1)
df3

                   A         B         C         D   sum_row result
2013-01-01  0.941956  1.213652 -0.203452  0.810892  2.763048   Over
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489 -1.310145  Under
2013-01-03  1.123943  0.451903  0.456308 -0.528767  1.503387   Over
2013-01-04 -0.212600  0.469454 -0.998607  0.122500 -0.619253  Under
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811 -0.634799  Under
2013-01-06 -0.242982  0.587188  1.516225  0.959050  2.819482   Over

In [387]:
# bins=[-100,0,100]
# labels =['under','over']      # bins 보다 하나 적은 갯수 (사이값) 이어야 한다.
pd.cut(df3.sum_row, bins=[-100,0,100], labels=['under','over'] )

2013-01-01     over
2013-01-02    under
2013-01-03     over
2013-01-04    under
2013-01-05    under
2013-01-06     over
Freq: D, Name: sum_row, dtype: category
Categories (2, object): ['under' < 'over']

In [388]:
df3 = df3.drop(columns='result')
df3

                   A         B         C         D   sum_row
2013-01-01  0.941956  1.213652 -0.203452  0.810892  2.763048
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489 -1.310145
2013-01-03  1.123943  0.451903  0.456308 -0.528767  1.503387
2013-01-04 -0.212600  0.469454 -0.998607  0.122500 -0.619253
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811 -0.634799
2013-01-06 -0.242982  0.587188  1.516225  0.959050  2.819482

In [389]:
df3.where((df3.sum_row>0) & (df3.B>0))    # boolean 으로 리턴하지 않고, 값을 리턴 하다. dropna() 을 붙일수 있다.

                   A         B         C         D   sum_row
2013-01-01  0.941956  1.213652 -0.203452  0.810892  2.763048
2013-01-02       NaN       NaN       NaN       NaN       NaN
2013-01-03  1.123943  0.451903  0.456308 -0.528767  1.503387
2013-01-04       NaN       NaN       NaN       NaN       NaN
2013-01-05       NaN       NaN       NaN       NaN       NaN
2013-01-06 -0.242982  0.587188  1.516225  0.959050  2.819482

In [390]:
df3[(df3.sum_row>0) & (df3.B>0)]

# dropna() 까지 한 결과

                   A         B         C         D   sum_row
2013-01-01  0.941956  1.213652 -0.203452  0.810892  2.763048
2013-01-03  1.123943  0.451903  0.456308 -0.528767  1.503387
2013-01-06 -0.242982  0.587188  1.516225  0.959050  2.819482

In [391]:
# df.query  을  사용

df3.query("sum_row > 0 and B >0")

                   A         B         C         D   sum_row
2013-01-01  0.941956  1.213652 -0.203452  0.810892  2.763048
2013-01-03  1.123943  0.451903  0.456308 -0.528767  1.503387
2013-01-06 -0.242982  0.587188  1.516225  0.959050  2.819482

### 4. Missing 

``` 
dropna()
fillna()
notnull()
notna()   
isnull()
isna() 
```

In [392]:
df3.where((df3.sum_row>0) & (df3.B>0)).fillna(0)

                   A         B         C         D   sum_row
2013-01-01  0.941956  1.213652 -0.203452  0.810892  2.763048
2013-01-02  0.000000  0.000000  0.000000  0.000000  0.000000
2013-01-03  1.123943  0.451903  0.456308 -0.528767  1.503387
2013-01-04  0.000000  0.000000  0.000000  0.000000  0.000000
2013-01-05  0.000000  0.000000  0.000000  0.000000  0.000000
2013-01-06 -0.242982  0.587188  1.516225  0.959050  2.819482

In [393]:
# 공백 값 (셀 값이 없음) 제거 

df_sp = pd.DataFrame({
    'A': range(6),
    'B': ['foo', '', 'bar', '', np.nan, 'xyz']
})
df_sp

   A    B
0  0  foo
1  1
2  2  bar
3  3
4  4  NaN
5  5  xyz

In [394]:
# unique() 로 공백을 확인 할 수 있다. 

df_sp['B'].unique()

array(['foo', '', 'bar', nan, 'xyz'], dtype=object)

In [395]:
# 공백('') 을 np.nan 으로 변경 

df_sp['B'] = df_sp['B'].replace('',np.nan)
df_sp['B'].unique()

array(['foo', nan, 'bar', 'xyz'], dtype=object)

### 5. Operations

```
sum, mean, std, var
sort, count
apply
str
```

In [396]:
print(df.sort_index())
print(df.sort_values('A'),'\n')
# df.sort_values(by='A')
print(df.sort_values(by= ['A','B'],ascending=False))

                   A         B         C         D
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-03  1.123943  0.451903  0.456308 -0.528767
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-06 -0.242982  0.587188  1.516225  0.959050
                   A         B         C         D
2013-01-06 -0.242982  0.587188  1.516225  0.959050
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-03  1.123943  0.451903  0.456308 -0.528767

                   A         B         C         D
2013-01-03  1.123943  0.451903  0.456308 -0.528767
2013-01-01  0.941956  1.213652 -0.203452  0.810892
2013-01-02  0.688637 -0.486205 -0.527088 -0.985489
2013-01-05 -0.093775 -1.126837  1.258623 -0.672811
2013-01-04 -0.212600  0.469454 -0.998607  0.122500
2013-01-06 -0.242982  0.587188  1.516225  0.959050

In [397]:
print(df.sum())          # row 들의 합 (col : 합) axis=0 디폴트
print(df.sum(axis=1))    # column 들의 함 (row : 합) axis=1

A    2.205179
B    1.109154
C    1.502011
D   -0.294625
dtype: float64
2013-01-01    2.763048
2013-01-02   -1.310145
2013-01-03    1.503387
2013-01-04   -0.619253
2013-01-05   -0.634799
2013-01-06    2.819482
Freq: D, dtype: float64

### 6. Merging

```
concat
join
merge
```

### 7. Grouping

```
Splitting the data into groups based on some criteria
Applying a function to each group independently
Combining the results into a data structure

Groupby 로 새로운 인덱스가 생성이되므로, 
apply 로 인해 각 row 별로 계산된 값은 
groupby 로 생성된 인덱스를 삭제하고,
gorupby 로 sort 된것을 기존 인덱스를 이용해 복구 해야 한다. 

```

In [398]:
df_g = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df_g

     A      B         C         D
0  foo    one  0.238891 -1.191276
1  bar    one -0.161728  1.142886
2  foo    two -0.586926  0.127287
3  bar  three -0.073107 -0.108793
4  foo    two  2.441571  0.882143
5  bar    two -0.651742 -0.574694
6  foo    one  0.971814  0.187056
7  foo  three  1.102483  1.395354

df.groupby().groups

In [399]:
df_g.groupby(['A','B']).groups

{('bar', 'one'): [1], ('bar', 'three'): [3], ('bar', 'two'): [5], ('foo', 'one'): [0, 6], ('foo', 'three'): [7], ('foo', 'two'): [2, 4]}

[].reset_index / [[]].reset_index

In [400]:
df_g.groupby(['A','B'])['C'].value_counts()

# df_g.groupby(['A','B'])['C'].value_counts().reset_index() 는 오류발생. ('C' 가 중복된다. )
# new_df_g = df_g.groupby(['A','B'])['C'].value_counts()
# new_df_g.name = C_count
# new_df_g.reset_index()

A    B      C
bar  one    -0.161728    1
     three  -0.073107    1
     two    -0.651742    1
foo  one     0.238891    1
             0.971814    1
     three   1.102483    1
     two    -0.586926    1
             2.441571    1
Name: count, dtype: int64

In [460]:
# [[C]] 은 데이터 프레임이라서 reset_index 가 가능하다. 
# groupby 로 인텍스화 되었던 A,B 가 columns 으로 재 배치 되고, 
# A B 의 unique 한 조합으로 새로운 df index 이 생성됨.
# 기존 8x4 -> 6x3

df_g2 = df_g.groupby(['A','B'])[['C']].sum().reset_index()
df_g2

     A      B         C
0  bar    one -0.161728
1  bar  three -0.073107
2  bar    two -0.651742
3  foo    one  1.210705
4  foo  three  1.102483
5  foo    two  1.854645

groupby().apply()

In [425]:
# 6개 유닉크한 AB groupby 의 구룹 key 값이 전달된다.

def funX(groupbyKey : pd.DataFrame.groupby) -> pd.DataFrame.groupby:
    print(groupbyKey)
    groupbyKey['C'] =  groupbyKey['C'].sum()
    print(groupbyKey)

    return groupbyKey

newG = df_g.groupby(['A','B']).apply(funX)
newG

# groupby 기준으로 index 가 생성이되고, 기존 index 는 level=2 가 추가된 multi_index df 가 생성됨.
# 기존 df 형태로 되돌리기 위해서는 
# groupby 로 생성된 index 0, 1을 삭제하여 기존 인덱스를 살리고, groupby 로 sort 되었던것을 기존 인덱스로 재 sort 해야함
# .reset_index(drop=True, level=(0,1)).sort_index()   
# 을 해주어야 함.

     A    B         C         D
1  bar  one -0.161728  1.142886
     A    B         C         D
1  bar  one -0.161728  1.142886
     A      B         C         D
3  bar  three -0.073107 -0.108793
     A      B         C         D
3  bar  three -0.073107 -0.108793
     A    B         C         D
5  bar  two -0.651742 -0.574694
     A    B         C         D
5  bar  two -0.651742 -0.574694
     A    B         C         D
0  foo  one  0.238891 -1.191276
6  foo  one  0.971814  0.187056
     A    B         C         D
0  foo  one  1.210705 -1.191276
6  foo  one  1.210705  0.187056
     A      B         C         D
7  foo  three  1.102483  1.395354
     A      B         C         D
7  foo  three  1.102483  1.395354
     A    B         C         D
2  foo  two -0.586926  0.127287
4  foo  two  2.441571  0.882143
     A    B         C         D
2  foo  two  1.854645  0.127287
4  foo  two  1.854645  0.882143

               A      B         C         D
A   B
bar one   1  bar    one -0.161728  1.142886
    three 3  bar  three -0.073107 -0.108793
    two   5  bar    two -0.651742 -0.574694
foo one   0  foo    one  1.210705 -1.191276
          6  foo    one  1.210705  0.187056
    three 7  foo  three  1.102483  1.395354
    two   2  foo    two  1.854645  0.127287
          4  foo    two  1.854645  0.882143

In [403]:
newG.reset_index(drop=True,level=(0,1)).sort_index()

# groupby 로 계산을 하고, 원래 8x4 형태로 되돌아 옴.

     A      B         C         D
0  foo    one  1.210705 -1.191276
1  bar    one -0.161728  1.142886
2  foo    two  1.854645  0.127287
3  bar  three -0.073107 -0.108793
4  foo    two  1.854645  0.882143
5  bar    two -0.651742 -0.574694
6  foo    one  1.210705  0.187056
7  foo  three  1.102483  1.395354

In [428]:
def funX(groupbyKey : pd.DataFrame.groupby) -> pd.Series.groupby:
    print(groupbyKey)
    groupbyKey = groupbyKey.sum()
    print(groupbyKey)  # 전체 columns 의 sum 결과인 Series
    # groupbyKey = groupbyKey+1  # 은 받은 DataFrame.groupby 을 리턴한다.
    return groupbyKey

df_g.groupby(['A','B']).apply(funX)

# A,B str 까지 sum 됨.

     A    B         C         D
1  bar  one -0.161728  1.142886
A         bar
B         one
C   -0.161728
D    1.142886
dtype: object
     A      B         C         D
3  bar  three -0.073107 -0.108793
A         bar
B       three
C   -0.073107
D   -0.108793
dtype: object
     A    B         C         D
5  bar  two -0.651742 -0.574694
A         bar
B         two
C   -0.651742
D   -0.574694
dtype: object
     A    B         C         D
0  foo  one  0.238891 -1.191276
6  foo  one  0.971814  0.187056
A      foofoo
B      oneone
C    1.210705
D   -1.004221
dtype: object
     A      B         C         D
7  foo  three  1.102483  1.395354
A         foo
B       three
C    1.102483
D    1.395354
dtype: object
     A    B         C         D
2  foo  two -0.586926  0.127287
4  foo  two  2.441571  0.882143
A      foofoo
B      twotwo
C    1.854645
D    1.009429
dtype: object

                A       B         C         D
A   B
bar one       bar     one -0.161728  1.142886
    three     bar   three -0.073107 -0.108793
    two       bar     two -0.651742 -0.574694
foo one    foofoo  oneone  1.210705 -1.004221
    three     foo   three  1.102483  1.395354
    two    foofoo  twotwo  1.854645  1.009429

In [443]:
# 6개 유닉크한 AB 조합의 C (Series)가 전달됨 (bar,one) 부터 (foo,two)까지

def funX(g_SE : pd.Series.groupby) -> pd.Series.values:
    print(g_SE)
    g_SE = g_SE.sum()
    print(g_SE)
    return g_SE

df_g.groupby(['A','B'])['C'].apply(funX)

# funX 에서는 series을 다뤄야 한다.

1   -0.161728
Name: (bar, one), dtype: float64
-0.1617281078944051
3   -0.073107
Name: (bar, three), dtype: float64
-0.07310725760872028
5   -0.651742
Name: (bar, two), dtype: float64
-0.6517419020560734
0    0.238891
6    0.971814
Name: (foo, one), dtype: float64
1.210705115352153
7    1.102483
Name: (foo, three), dtype: float64
1.102482692591538
2   -0.586926
4    2.441571
Name: (foo, two), dtype: float64
1.8546448308829881

A    B
bar  one     -0.161728
     three   -0.073107
     two     -0.651742
foo  one      1.210705
     three    1.102483
     two      1.854645
Name: C, dtype: float64

In [448]:
def funX(groupbyKey :pd.DataFrame.groupby) -> pd.Series.values :
    print(groupbyKey)
    g_SE =  groupbyKey['C'].sum()       # 전달 받은 groupby 별 C 컬럼들 의 sum  : groupby 갯수만큼 리턴
    print(g_SE)
    return g_SE

df_g.groupby(['A','B']).apply(funX)

     A    B         C         D
1  bar  one -0.161728  1.142886
-0.1617281078944051
     A      B         C         D
3  bar  three -0.073107 -0.108793
-0.07310725760872028
     A    B         C         D
5  bar  two -0.651742 -0.574694
-0.6517419020560734
     A    B         C         D
0  foo  one  0.238891 -1.191276
6  foo  one  0.971814  0.187056
1.210705115352153
     A      B         C         D
7  foo  three  1.102483  1.395354
1.102482692591538
     A    B         C         D
2  foo  two -0.586926  0.127287
4  foo  two  2.441571  0.882143
1.8546448308829881

A    B
bar  one     -0.161728
     three   -0.073107
     two     -0.651742
foo  one      1.210705
     three    1.102483
     two      1.854645
dtype: float64

In [456]:
def funX(g_SE : pd.Series.groupby) -> pd.Series.groupby:
    print(g_SE)
    g_SE = g_SE+1    # 전달 받은 group 형태 그대로 전달한다.
    print(g_SE)
    return g_SE

myg_S = df_g.groupby(['A','B'])['C'].apply(funX)
myg_S

1   -0.161728
Name: (bar, one), dtype: float64
1    0.838272
Name: (bar, one), dtype: float64
3   -0.073107
Name: (bar, three), dtype: float64
3    0.926893
Name: (bar, three), dtype: float64
5   -0.651742
Name: (bar, two), dtype: float64
5    0.348258
Name: (bar, two), dtype: float64
0    0.238891
6    0.971814
Name: (foo, one), dtype: float64
0    1.238891
6    1.971814
Name: (foo, one), dtype: float64
7    1.102483
Name: (foo, three), dtype: float64
7    2.102483
Name: (foo, three), dtype: float64
2   -0.586926
4    2.441571
Name: (foo, two), dtype: float64
2    0.413074
4    3.441571
Name: (foo, two), dtype: float64

A    B
bar  one    1    0.838272
     three  3    0.926893
     two    5    0.348258
foo  one    0    1.238891
            6    1.971814
     three  7    2.102483
     two    2    0.413074
            4    3.441571
Name: C, dtype: float64

In [457]:
# 동일하게 groupby 로 구성된 index 을 삭제하고, 기존 index 을 복구해야 한다. 

myg_S

A    B
bar  one    1    0.838272
     three  3    0.926893
     two    5    0.348258
foo  one    0    1.238891
            6    1.971814
     three  7    2.102483
     two    2    0.413074
            4    3.441571
Name: C, dtype: float64

In [459]:
myg_S.reset_index(drop=True, level=(0,1)).sort_index()

0    1.238891
1    0.838272
2    0.413074
3    0.926893
4    3.441571
5    0.348258
6    1.971814
7    2.102483
Name: C, dtype: float64

In [434]:
pd.Series([[1,3],[2]])

0    [1, 3]
1       [2]
dtype: object

In [435]:
pd.DataFrame([[1,3],[2]])

   0    1
0  1  3.0
1  2  NaN

In [409]:
df_g.groupby(['A','B'])[['C']].sum().unstack(level=0)  # B 을 는 levle = 1

              C
A           bar       foo
B
one   -0.161728  1.210705
three -0.073107  1.102483
two   -0.651742  1.854645

### 8. Reshaping

```
reshpae(-1)
stack    : index <--- columns  
unstack  : index ---> columns  
pivot table
```

In [410]:
df_g.set_index(['A','B'])[['C']]#.unstack()

# Index contains duplicate entries, cannot reshape : 'foo one' 이 중복된다. 
# df.drop_duplicates(subset=['index','column']) 으로 해결

                  C
A   B
foo one    0.238891
bar one   -0.161728
foo two   -0.586926
bar three -0.073107
foo two    2.441571
bar two   -0.651742
foo one    0.971814
    three  1.102483

drop_duplicates

subset : 중복을 검사할 column 
keep: 중복값중 남길 행

df.drop ()
axis = 0/1 (행/열)     조건이 있는 경우 slicing 을 이용하자

In [411]:
# df_g2 = df_g.drop([6,2]).reset_index(drop=True) 
# A,B 열 값이 중복되는 2, 6 row을 삭제

df_g2 = df_g.drop_duplicates(subset=['A','B'],keep='first', ignore_index=True).copy()  # inplace = True 으로 원본 적용

df_g2

     A      B         C         D
0  foo    one  0.238891 -1.191276
1  bar    one -0.161728  1.142886
2  foo    two -0.586926  0.127287
3  bar  three -0.073107 -0.108793
4  bar    two -0.651742 -0.574694
5  foo  three  1.102483  1.395354

In [412]:
df_g2.set_index(['A','B'])[['C']].unstack()

            C
B         one     three       two
A
bar -0.161728 -0.073107 -0.651742
foo  0.238891  1.102483 -0.586926

In [413]:
df_g2.pivot(index='A',columns='B',values='C')

B         one     three       two
A
bar -0.161728 -0.073107 -0.651742
foo  0.238891  1.102483 -0.586926

pivot_table()

In [414]:
df_g2.pivot_table(index ='A',columns='B',values='C')

# pd.pivot_table(df_g2, index ='A',columns='B',values='C')

B         one     three       two
A
bar -0.161728 -0.073107 -0.651742
foo  0.238891  1.102483 -0.586926

### 9. Time Series

In [415]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum()

2012-01-01    24394
Freq: 5T, dtype: int64

In [416]:
ts

2012-01-01 00:00:00    337
2012-01-01 00:00:01    352
2012-01-01 00:00:02    325
2012-01-01 00:00:03    143
2012-01-01 00:00:04     32
                      ...
2012-01-01 00:01:35    433
2012-01-01 00:01:36    192
2012-01-01 00:01:37    349
2012-01-01 00:01:38    148
2012-01-01 00:01:39     55
Freq: S, Length: 100, dtype: int64

### 10. Categroicals

### 11. Plotting